Revit 2026 API

# UIApplicationCreateRibbonPanel(String, String) Method

---

Create a new RibbonPanel on the specified tab.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual RibbonPanel CreateRibbonPanel(
	string tabName,
	string panelName
)
```
```vb
Public Overridable Function CreateRibbonPanel (
	tabName As String,
	panelName As String
) As RibbonPanel
```
```cpp
public:
virtual RibbonPanel^ CreateRibbonPanel(
	String^ tabName,
	String^ panelName
)
```
```fsharp
abstract CreateRibbonPanel :
        tabName : string *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tabName : string *
        panelName : string -> RibbonPanel
```

#### Parameters

tabName String
    The name of the tab, on which the new panel will be created.
panelName String
    The name of the panel to be created.

#### Return Value

RibbonPanel

| Exception | Condition |
| --- | --- |
| ArgumentNullException | tabName or panelName is . |
| ArgumentException | tabName or panelName is Empty. |
| InvalidOperationException | Too many panels have been added to this tab (Maximum is 100). |

This method will create a custom panel appending to the specified tab. This method is not supported in Macros.

#### Reference

UIApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace